### Terraform Plan Output for `identity-team-account`
```hcl
[command]/home/runner/work/_temp/7c186476-16da-4369-b034-2f857d9eab19/terraform-bin show -no-color tfplan.binary

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role_policy.custom_inline_policy will be created
  + resource "aws_iam_role_policy" "custom_inline_policy" {
      + id          = (known after apply)
      + name        = "CustomOIDCPolicy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sso:CreatePermissionSet",
                          + "sso:DescribePermissionSet",
                          + "sso:UpdatePermissionSet",
                          + "sso:DeletePermissionSet",
                          + "sso:AttachManagedPolicyToPermissionSet",
                          + "sso:ListPermissionSets",
                          + "sso:ListInstances",
                          + "sso:ProvisionPermissionSet",
                          + "sso:PutInlinePolicyToPermissionSet",
                          + "sso:DeleteInlinePolicyFromPermissionSet",
                          + "sso:ListPermissionSetProvisioningStatus",
                          + "organizations:*",
                          + "identitystore:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                      + Sid      = "S3Access"
                    },
                  + {
                      + Action   = [
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "KMSAccess"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DynamoDBAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "identity-role"
    }

  # module.github_oidc.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.github_oidc.aws_iam_role.oidc_role will be created
  + resource "aws_iam_role" "oidc_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "identity-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy[""] will be created
  + resource "aws_iam_role_policy_attachment" "attach_policy" {
      + id   = (known after apply)
      + role = "identity-role"
    }

  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy["arn:aws:iam::aws:policy/AdministratorAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "attach_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "identity-role"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role_policy.custom_inline_policy will be created%0A  + resource "aws_iam_role_policy" "custom_inline_policy" {%0A      + id          = (known after apply)%0A      + name        = "CustomOIDCPolicy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "sso:CreatePermissionSet",%0A                          + "sso:DescribePermissionSet",%0A                          + "sso:UpdatePermissionSet",%0A                          + "sso:DeletePermissionSet",%0A                          + "sso:AttachManagedPolicyToPermissionSet",%0A                          + "sso:ListPermissionSets",%0A                          + "sso:ListInstances",%0A                          + "sso:ProvisionPermissionSet",%0A                          + "sso:PutInlinePolicyToPermissionSet",%0A                          + "sso:DeleteInlinePolicyFromPermissionSet",%0A                          + "sso:ListPermissionSetProvisioningStatus",%0A                          + "organizations:*",%0A                          + "identitystore:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "*",%0A                        ]%0A                      + Sid      = "S3Access"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "kms:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "KMSAccess"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "DynamoDBAccess"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = "identity-role"%0A    }%0A%0A  # module.github_oidc.aws_iam_openid_connect_provider.github will be created%0A  + resource "aws_iam_openid_connect_provider" "github" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = [%0A          + "6938fd4d98bab03faadb97b34396831e3780aea1",%0A        ]%0A      + url             = "https://token.actions.githubusercontent.com"%0A    }%0A%0A  # module.github_oidc.aws_iam_role.oidc_role will be created%0A  + resource "aws_iam_role" "oidc_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "identity-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy[""] will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_policy" {%0A      + id   = (known after apply)%0A      + role = "identity-role"%0A    }%0A%0A  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy["arn:aws:iam::aws:policy/AdministratorAccess"] will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "identity-role"%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role_policy.custom_inline_policy will be created%0A  + resource "aws_iam_role_policy" "custom_inline_policy" {%0A      + id          = (known after apply)%0A      + name        = "CustomOIDCPolicy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "sso:CreatePermissionSet",%0A                          + "sso:DescribePermissionSet",%0A                          + "sso:UpdatePermissionSet",%0A                          + "sso:DeletePermissionSet",%0A                          + "sso:AttachManagedPolicyToPermissionSet",%0A                          + "sso:ListPermissionSets",%0A                          + "sso:ListInstances",%0A                          + "sso:ProvisionPermissionSet",%0A                          + "sso:PutInlinePolicyToPermissionSet",%0A                          + "sso:DeleteInlinePolicyFromPermissionSet",%0A                          + "sso:ListPermissionSetProvisioningStatus",%0A                          + "organizations:*",%0A                          + "identitystore:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "*",%0A                        ]%0A                      + Sid      = "S3Access"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "kms:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "KMSAccess"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                      + Sid      = "DynamoDBAccess"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = "identity-role"%0A    }%0A%0A  # module.github_oidc.aws_iam_openid_connect_provider.github will be created%0A  + resource "aws_iam_openid_connect_provider" "github" {%0A      + arn             = (known after apply)%0A      + client_id_list  = [%0A          + "sts.amazonaws.com",%0A        ]%0A      + id              = (known after apply)%0A      + tags_all        = (known after apply)%0A      + thumbprint_list = [%0A          + "6938fd4d98bab03faadb97b34396831e3780aea1",%0A        ]%0A      + url             = "https://token.actions.githubusercontent.com"%0A    }%0A%0A  # module.github_oidc.aws_iam_role.oidc_role will be created%0A  + resource "aws_iam_role" "oidc_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "identity-role"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy[""] will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_policy" {%0A      + id   = (known after apply)%0A      + role = "identity-role"%0A    }%0A%0A  # module.github_oidc.aws_iam_role_policy_attachment.attach_policy["arn:aws:iam::aws:policy/AdministratorAccess"] will be created%0A  + resource "aws_iam_role_policy_attachment" "attach_policy" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "identity-role"%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A

::set-output name=stderr::

::set-output name=exitcode::0
```